PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/wifi_manager/wifi_manager.c
                if (ctx->state_callback) {
                    ctx->state_callback(ctx->state, ctx->user_data);
                }
                
                if (esp_wifi_sta_get_ap_info(&ctx->ap_info) != ESP_OK) {
                    LOG_W(TAG, "Failed to get AP info");
                }
                break;
            }
            
            case IP_EVENT_STA_LOST_IP:
                LOG_W(TAG, "Lost IP address");
                if (ctx->state != WIFI_MANAGER_STATE_STA_AP_MODE) {
                    safe_wifi_clear_bits(ctx, WIFI_CONNECTED_BIT);
                }
                break;
                
            default:
                LOG_D(TAG, "Unhandled IP event: %d", (int)event_id);
                break;
        }
    }
}

esp_err_t wifi_manager_init(void)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    esp_err_t ret = ESP_OK;
    
    if (ctx->event_group != NULL) {
        LOG_W(TAG, "WiFi Manager already initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    LOG_I(TAG, "Initializing WiFi Manager");
    
    ctx->state = WIFI_MANAGER_STATE_INIT;
    ctx->scan_in_progress = false;
    ctx->temporary_apsta_mode = false;
    ctx->connection_in_progress = false;
    ctx->event_group_operations = 0;
    ctx->netif_recreation_count = 0;
    
    ctx->event_group = xEventGroupCreate();
    if (ctx->event_group == NULL) {
        LOG_E(TAG, "Failed to create event group");
        return ESP_ERR_NO_MEM;
    }
    
    ctx->connection_mutex = xSemaphoreCreateMutex();
    if (ctx->connection_mutex == NULL) {
        vEventGroupDelete(ctx->event_group);
        ctx->event_group = NULL;
        LOG_E(TAG, "Failed to create connection mutex");
        return ESP_ERR_NO_MEM;
    }
    
    ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        LOG_W(TAG, "NVS needs to be erased");
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);
    
    LOG_I(TAG, "Initializing TCP/IP stack");
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());
    
    LOG_I(TAG, "Creating WiFi station netif");
    ctx->sta_netif = esp_netif_create_default_wifi_sta();
    if (ctx->sta_netif == NULL) {
        LOG_E(TAG, "Failed to create station netif");
        vSemaphoreDelete(ctx->connection_mutex);
        vEventGroupDelete(ctx->event_group);
        ctx->connection_mutex = NULL;
        ctx->event_group = NULL;
        return ESP_FAIL;
    }
    
    LOG_I(TAG, "Creating WiFi AP netif");
    ctx->ap_netif = esp_netif_create_default_wifi_ap();
    if (ctx->ap_netif == NULL) {
        LOG_E(TAG, "Failed to create AP netif");
        esp_netif_destroy(ctx->sta_netif);
        vSemaphoreDelete(ctx->connection_mutex);
        vEventGroupDelete(ctx->event_group);
        ctx->connection_mutex = NULL;
        ctx->event_group = NULL;
        return ESP_FAIL;
    }
    
    wifi_init_config_t wifi_init_config = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&wifi_init_config));
    
    LOG_I(TAG, "Registering event handlers");
    ESP_ERROR_CHECK(esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID,
                                                       &wifi_event_handler, NULL, NULL));
    ESP_ERROR_CHECK(esp_event_handler_instance_register(IP_EVENT, ESP_EVENT_ANY_ID,
                                                       &wifi_event_handler, NULL, NULL));
    
    LOG_I(TAG, "Setting WiFi to station mode");
    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
    ESP_ERROR_CHECK(esp_wifi_start());
    
    ret = config_manager_get_str("wifi_ssid", ctx->ssid, sizeof(ctx->ssid));
    if (ret == ESP_OK) {
        ret = config_manager_get_str("wifi_password", ctx->password, sizeof(ctx->password));
        if (ret == ESP_OK) {
            LOG_I(TAG, "Found saved WiFi credentials for SSID: %s", ctx->ssid);
            ctx->credentials_saved = true;
        } else {
            ctx->credentials_saved = false;
        }
    } else {
        ctx->credentials_saved = false;
    }
    
    memset(&ctx->scan_config, 0, sizeof(ctx->scan_config));
    ctx->scan_config.show_hidden = true;
    ctx->scan_config.scan_type = WIFI_SCAN_TYPE_ACTIVE;
    ctx->scan_config.scan_time.active.min = 100;
    ctx->scan_config.scan_time.active.max = 300;
    
    ctx->state = WIFI_MANAGER_STATE_DISCONNECTED;
    safe_wifi_set_bits(ctx, WIFI_DISCONNECTED_BIT);
    
    LOG_I(TAG, "WiFi Manager initialized successfully");
    return ESP_OK;
}

esp_err_t wifi_manager_connect(const char *ssid, const char *password, bool save)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL || ctx->connection_mutex == NULL) {
        LOG_E(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (ssid == NULL) {
        LOG_E(TAG, "SSID is NULL");
        return ESP_ERR_INVALID_ARG;
    }
    
    if (strlen(ssid) > 32) {
        LOG_E(TAG, "SSID too long");
        return ESP_ERR_INVALID_ARG;
    }
    
    if (password != NULL && strlen(password) > 64) {
        LOG_E(TAG, "Password too long");
        return ESP_ERR_INVALID_ARG;
    }
    
    if (xSemaphoreTake(ctx->connection_mutex, pdMS_TO_TICKS(5000)) != pdTRUE) {
        LOG_E(TAG, "Could not acquire connection mutex");
        return ESP_ERR_TIMEOUT;
    }
    
    LOG_I(TAG, "Connecting to WiFi network: %s", ssid);
    
    esp_err_t disconnect_ret = esp_wifi_disconnect();
    if (disconnect_ret != ESP_OK && disconnect_ret != ESP_ERR_WIFI_NOT_CONNECT) {
        LOG_W(TAG, "Disconnect failed: %s", esp_err_to_name(disconnect_ret));
    }
    
    ctx->connection_in_progress = false;
    
    vTaskDelay(pdMS_TO_TICKS(500));
    
    strncpy(ctx->ssid, ssid, sizeof(ctx->ssid) - 1);
    ctx->ssid[sizeof(ctx->ssid) - 1] = '\0';
    
    if (password != NULL) {
        strncpy(ctx->password, password, sizeof(ctx->password) - 1);
        ctx->password[sizeof(ctx->password) - 1] = '\0';
    } else {
        ctx->password[0] = '\0';
    }
    
