PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/wifi_manager/wifi_manager.c
    if (save) {
        LOG_I(TAG, "Saving WiFi credentials");
        ESP_ERROR_CHECK(config_manager_set_str("wifi_ssid", ctx->ssid));
        ESP_ERROR_CHECK(config_manager_set_str("wifi_password", ctx->password));
        ctx->credentials_saved = true;
    }
    
    wifi_config_t wifi_config = {0};
    strncpy((char *)wifi_config.sta.ssid, ctx->ssid, sizeof(wifi_config.sta.ssid) - 1);
    if (ctx->password[0] != '\0') {
        strncpy((char *)wifi_config.sta.password, ctx->password, sizeof(wifi_config.sta.password) - 1);
    }
    
    wifi_config.sta.scan_method = WIFI_FAST_SCAN;
    wifi_config.sta.sort_method = WIFI_CONNECT_AP_BY_SIGNAL;
    wifi_config.sta.threshold.rssi = -127;
    wifi_config.sta.threshold.authmode = WIFI_AUTH_WPA2_PSK;
    
    wifi_mode_t current_mode;
    ESP_ERROR_CHECK(esp_wifi_get_mode(&current_mode));
    
    if (current_mode == WIFI_MODE_AP) {
        LOG_I(TAG, "Changing from AP to STA+AP mode");
        ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_APSTA));
        ctx->state = WIFI_MANAGER_STATE_STA_AP_MODE;
    } else if (current_mode == WIFI_MODE_APSTA) {
        LOG_I(TAG, "Updating STA configuration in STA+AP mode");
    } else {
        ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
    }
    
    ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_STA, &wifi_config));
    
    if (ctx->state != WIFI_MANAGER_STATE_STA_AP_MODE) {
        ctx->state = WIFI_MANAGER_STATE_CONNECTING;
    }
    ctx->reconnect_attempts = 0;
    if (ctx->state_callback) {
        ctx->state_callback(ctx->state, ctx->user_data);
    }
    
    esp_err_t connect_result = _internal_wifi_connect_safe();
    
    xSemaphoreGive(ctx->connection_mutex);
    
    if (connect_result != ESP_OK) {
        LOG_W(TAG, "Initial connection attempt failed: %s", esp_err_to_name(connect_result));
    }
    
    EventBits_t bits = xEventGroupWaitBits(ctx->event_group,
                                          WIFI_CONNECTED_BIT | WIFI_CONNECT_FAIL_BIT,
                                          pdFALSE, pdFALSE, pdMS_TO_TICKS(WIFI_CONNECT_TIMEOUT_MS));
    
    if (bits & WIFI_CONNECTED_BIT) {
        LOG_I(TAG, "Successfully connected to WiFi network");
        return ESP_OK;
    } else if (bits & WIFI_CONNECT_FAIL_BIT) {
        LOG_E(TAG, "Failed to connect to WiFi network");
        if (ctx->state != WIFI_MANAGER_STATE_STA_AP_MODE) {
            ctx->state = WIFI_MANAGER_STATE_ERROR;
            if (ctx->state_callback) {
                ctx->state_callback(ctx->state, ctx->user_data);
            }
        }
        return ESP_FAIL;
    } else {
        LOG_W(TAG, "Connection attempt timed out");
        if (ctx->state != WIFI_MANAGER_STATE_STA_AP_MODE) {
            ctx->state = WIFI_MANAGER_STATE_ERROR;
            if (ctx->state_callback) {
                ctx->state_callback(ctx->state, ctx->user_data);
            }
        }
        return ESP_ERR_TIMEOUT;
    }
}

esp_err_t wifi_manager_connect_saved(void)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        LOG_E(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (!ctx->credentials_saved) {
        LOG_W(TAG, "No saved WiFi credentials");
        return ESP_ERR_NOT_FOUND;
    }
    
    LOG_I(TAG, "Connecting with saved credentials, SSID: %s", ctx->ssid);
    return wifi_manager_connect(ctx->ssid, ctx->password, false);
}

esp_err_t wifi_manager_disconnect(void)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        LOG_E(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (ctx->state != WIFI_MANAGER_STATE_CONNECTED && 
        ctx->state != WIFI_MANAGER_STATE_CONNECTING &&
        ctx->state != WIFI_MANAGER_STATE_STA_AP_MODE) {
        LOG_W(TAG, "Not connected to WiFi");
        return ESP_ERR_INVALID_STATE;
    }
    
    LOG_I(TAG, "Disconnecting from WiFi network: %s", ctx->ssid);
    ESP_ERROR_CHECK(esp_wifi_disconnect());
    
    if (ctx->state == WIFI_MANAGER_STATE_STA_AP_MODE) {
        LOG_I(TAG, "Remaining in AP mode after STA disconnection");
        ctx->state = WIFI_MANAGER_STATE_AP_MODE;
        if (ctx->state_callback) {
            ctx->state_callback(ctx->state, ctx->user_data);
        }
        return ESP_OK;
    }
    
    EventBits_t bits = xEventGroupWaitBits(ctx->event_group,
                                          WIFI_DISCONNECTED_BIT,
                                          pdFALSE, pdFALSE, pdMS_TO_TICKS(5000));
    
    if (bits & WIFI_DISCONNECTED_BIT) {
        LOG_I(TAG, "Successfully disconnected from WiFi");
        return ESP_OK;
    } else {
        LOG_W(TAG, "Timeout waiting for disconnection");
        return ESP_ERR_TIMEOUT;
    }
}

esp_err_t wifi_manager_start_ap_mode(const char *ap_ssid, const char *ap_password)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        LOG_E(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (ap_ssid == NULL) {
        LOG_E(TAG, "AP SSID is NULL");
        return ESP_ERR_INVALID_ARG;
    }
    
    if (strlen(ap_ssid) > 32) {
        LOG_E(TAG, "AP SSID too long");
        return ESP_ERR_INVALID_ARG;
    }
    
    if (ap_password != NULL && strlen(ap_password) > 64) {
        LOG_E(TAG, "AP Password too long");
        return ESP_ERR_INVALID_ARG;
    }
    
    LOG_I(TAG, "Starting WiFi Access Point: %s", ap_ssid);
    
    if (ctx->state == WIFI_MANAGER_STATE_CONNECTED || 
        ctx->state == WIFI_MANAGER_STATE_CONNECTING) {
        LOG_I(TAG, "Disconnecting from current network before starting AP");
        ESP_ERROR_CHECK(esp_wifi_disconnect());
        
        EventBits_t bits = xEventGroupWaitBits(ctx->event_group,
                                              WIFI_DISCONNECTED_BIT,
                                              pdFALSE, pdFALSE, pdMS_TO_TICKS(5000));
        if ((bits & WIFI_DISCONNECTED_BIT) == 0) {
            LOG_W(TAG, "Timeout waiting for disconnection");
        }
    }
    
    strncpy(ctx->ap_ssid, ap_ssid, sizeof(ctx->ap_ssid) - 1);
    ctx->ap_ssid[sizeof(ctx->ap_ssid) - 1] = '\0';
    
    if (ap_password != NULL) {
        strncpy(ctx->ap_password, ap_password, sizeof(ctx->ap_password) - 1);
        ctx->ap_password[sizeof(ctx->ap_password) - 1] = '\0';
    } else {
        ctx->ap_password[0] = '\0';
    }
    
    wifi_config_t ap_config = {0};
    strncpy((char *)ap_config.ap.ssid, ctx->ap_ssid, sizeof(ap_config.ap.ssid) - 1);
    ap_config.ap.ssid_len = strlen(ctx->ap_ssid);
    
    if (ctx->ap_password[0] != '\0' && strlen(ctx->ap_password) >= 8) {
        strncpy((char *)ap_config.ap.password, ctx->ap_password, sizeof(ap_config.ap.password) - 1);
        ap_config.ap.authmode = WIFI_AUTH_WPA2_PSK;
    } else {
        ap_config.ap.authmode = WIFI_AUTH_OPEN;
    }
    
    ap_config.ap.max_connection = 4;
    ap_config.ap.beacon_interval = 100;
    
