PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/wifi_manager/wifi_manager.c
    if (results == NULL || num_networks == NULL) {
        LOG_E(TAG, "Invalid output parameters");
        return ESP_ERR_INVALID_ARG;
    }
    
    if (ctx->scan_in_progress) {
        LOG_I(TAG, "Waiting for scan to complete");
        
        EventBits_t bits = xEventGroupWaitBits(ctx->event_group,
                                              WIFI_SCAN_DONE_BIT,
                                              pdFALSE, pdFALSE, pdMS_TO_TICKS(10000));
        
        if ((bits & WIFI_SCAN_DONE_BIT) == 0) {
            LOG_W(TAG, "Timeout waiting for scan to complete");
            return ESP_ERR_TIMEOUT;
        }
    }
    
    if (ctx->scan_ap_list == NULL || ctx->scan_ap_count == 0) {
        LOG_W(TAG, "No scan results available");
        *num_networks = 0;
        return ESP_ERR_NOT_FOUND;
    }
    
    size_t count = (ctx->scan_ap_count < max_networks) ? ctx->scan_ap_count : max_networks;
    for (size_t i = 0; i < count; i++) {
        strncpy(results[i].ssid, (char *)ctx->scan_ap_list[i].ssid, sizeof(results[i].ssid) - 1);
        results[i].ssid[sizeof(results[i].ssid) - 1] = '\0';
        results[i].rssi = ctx->scan_ap_list[i].rssi;
        results[i].auth_mode = ctx->scan_ap_list[i].authmode;
    }
    
    *num_networks = count;
    LOG_I(TAG, "Returning %zu scan results", count);
    return ESP_OK;
}

esp_err_t wifi_manager_set_state_callback(void (*callback)(wifi_manager_state_t state, void *user_data), void *user_data)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        LOG_E(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    ctx->state_callback = callback;
    ctx->user_data = user_data;
    
    return ESP_OK;
}

esp_err_t wifi_manager_handle_disconnection(const char *ap_ssid_prefix, const char *ap_password, int max_attempts) {
    static int reconnect_attempts = 0;
    static int recovery_cycle = 0;
    static int64_t last_reconnect_time = 0;
    static bool ap_mode_active = false;
    static int netif_cleanup_cycle = 0;
    int64_t current_time = esp_timer_get_time() / 1000;
    
    const int64_t RECONNECT_INTERVAL_MS = 8000;
    const int NETIF_CLEANUP_THRESHOLD = 50;
    const int ATTEMPTS_BEFORE_AP = 5;
    
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (wifi_manager_is_connected()) {
        reconnect_attempts = 0;
        recovery_cycle = 0;
        ap_mode_active = false;
        return ESP_OK;
    }
    
    if (current_time - last_reconnect_time > RECONNECT_INTERVAL_MS) {
        last_reconnect_time = current_time;
        
        if (!ctx->credentials_saved) {
            if (!ap_mode_active) {
                char ap_ssid[33];
                esp_err_t ap_ret = wifi_manager_generate_ap_ssid(ap_ssid, sizeof(ap_ssid), ap_ssid_prefix);
                if (ap_ret != ESP_OK) {
                    LOG_E(TAG, "Failed to generate AP SSID");
                    return ESP_FAIL;
                }
                
                LOG_I(TAG, "No credentials - starting AP+STA with SSID: %s", ap_ssid);
                
                ap_ret = wifi_manager_start_sta_ap_mode(ap_ssid, ap_password);
                if (ap_ret == ESP_OK) {
                    ap_mode_active = true;
                    reconnect_attempts = 0;
                } else {
                    LOG_E(TAG, "Failed to start AP+STA mode");
                }
            }
            return ESP_OK;
        }
        
        reconnect_attempts++;
        netif_cleanup_cycle++;
        
        if (netif_cleanup_cycle >= NETIF_CLEANUP_THRESHOLD) {
            LOG_I(TAG, "Performing netif cleanup after %d reconnections", netif_cleanup_cycle);
            
            esp_wifi_stop();
            vTaskDelay(pdMS_TO_TICKS(500));
            
            if (cleanup_and_recreate_netifs(ctx) == ESP_OK) {
                LOG_I(TAG, "Netifs recreated successfully");
                netif_cleanup_cycle = 0;
            } else {
                LOG_E(TAG, "Failed to recreate netifs");
            }
            
            esp_wifi_start();
            vTaskDelay(pdMS_TO_TICKS(1000));
        }
        
        LOG_I(TAG, "WiFi recovery cycle %d, reconnection attempt %d (cleanup cycle: %d)", 
                 recovery_cycle + 1, reconnect_attempts, netif_cleanup_cycle);
        
        if (reconnect_attempts % 5 == 0 && netif_cleanup_cycle < NETIF_CLEANUP_THRESHOLD) {
            esp_wifi_stop();
            vTaskDelay(pdMS_TO_TICKS(1000));
            esp_wifi_start();
            vTaskDelay(pdMS_TO_TICKS(2000));
        }
        
        if (!ap_mode_active && reconnect_attempts >= ATTEMPTS_BEFORE_AP) {
            char ap_ssid[33];
            esp_err_t ap_ret = wifi_manager_generate_ap_ssid(ap_ssid, sizeof(ap_ssid), ap_ssid_prefix);
            if (ap_ret != ESP_OK) {
                LOG_E(TAG, "Failed to generate AP SSID");
                return ESP_FAIL;
            }
            
            LOG_I(TAG, "Starting AP+STA with SSID: %s while continuing reconnection attempts", ap_ssid);
            
            ap_ret = wifi_manager_start_sta_ap_mode(ap_ssid, ap_password);
            if (ap_ret == ESP_OK) {
                ap_mode_active = true;
            } else {
                LOG_E(TAG, "Failed to start AP+STA mode");
            }
        }
        
        esp_err_t ret = wifi_manager_connect_saved();
        if (ret != ESP_OK) {
            LOG_W(TAG, "Connection attempt failed: %s", esp_err_to_name(ret));
        }
    }
    
    return ESP_OK;
}

esp_err_t wifi_manager_generate_ap_ssid(char *ap_ssid, size_t max_len, const char *prefix)
{
    if (ap_ssid == NULL || max_len < 8 || prefix == NULL) {
        LOG_E(TAG, "Invalid parameters for AP SSID generation");
        return ESP_ERR_INVALID_ARG;
    }
    
    char esp32_id[ESP32_ID_LENGTH + 1];
    esp_err_t ret = esp32_id_manager_get_id(esp32_id, sizeof(esp32_id));
    if (ret != ESP_OK) {
        LOG_E(TAG, "Failed to get ESP32 ID");
        return ret;
    }
    
    size_t id_len = strlen(esp32_id);
    size_t prefix_len = strlen(prefix);
    
    if (id_len < 6 || prefix_len + 7 > max_len) {
        LOG_E(TAG, "ID too short or buffer too small");
        return ESP_ERR_INVALID_ARG;
    }
    
    snprintf(ap_ssid, max_len, "%s_%s", prefix, &esp32_id[id_len - 6]);
    
    LOG_I(TAG, "Generated AP SSID: %s", ap_ssid);
    return ESP_OK;
}